# Shell
brew 'zsh'
brew 'starship'
brew 'eza'
brew 'fd'
brew 'fzf'

# Text parsers for JSON and YAML
brew 'jq'
brew 'yq'

# Utilities
brew 'direnv'
brew 'httpie'
brew 'cookiecutter'

# Language Managers
brew 'goenv'
brew 'tfenv'
brew 'pyenv'
brew 'nvm'
brew 'uv'